---
kind: method
id: M:Autodesk.Revit.DB.ProjectLocationSet.GetEnumerator
source: html/5b8669c5-0c9a-756d-6a30-d465bc043dae.htm
---
# Autodesk.Revit.DB.ProjectLocationSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.